app/views/tasks/index.html.erb

<%= render :partial => "header", :object => {
  "title" => "Tasks",
  "entity" => @tasks.first,
  "actions" =>[{
    "icon" => "plus",
    "text" => "New Task",
    "path" => new_task_path,
    "ctrlAction" => :create
  }]
---
SELECT "tasks".* FROM "tasks"