app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
<%= render :partial => "header", :object => {
  "entity" => @users.first,
  "title" => "Users",
  "actions" =>[{
    "icon" => "plus",
    "text" => "New User",
    "path" => new_user_path,
    "ctrlAction" => :create
  }]