app/views/packages/index.html.erb

SELECT "packages".* FROM "packages"
---
<%= render :partial => "header", :object => {
  "entity" => @packages.first,
  "title" => "Packages",
  "actions" =>[{
    "icon" => "plus",
    "text" => "New Package",
    "path" => new_package_path,
    "ctrlAction" => :create
  }]