app/views/roles/index.html.erb

SELECT "roles".* FROM "roles"
---
<%= render :partial => "header", :object => {
  "title" => "Roles",
  "entity" => @roles.first,
  "actions" =>[{
    "icon" => "plus",
    "text" => "New Role",
    "path" => new_role_path,
    "ctrlAction" => :create
  }]