app/views/systems/_form.html.erb

SELECT "system_groups".* FROM "system_groups"
---
    <%= f.label :system_group_id %><br>
    <%= f.collection_select(:system_group_id, SystemGroup.all, :id, :name) %>