app/views/systems/index.html.erb

SELECT "systems".* FROM "systems"
---
        <td><%= system.last_seen %></td>
        <td><%= system.system_group.blank? ? "-" : system.system_group.name %></td>