app/controllers/group_assignments_controller.rb

SELECT "group_assignments".* FROM "group_assignments"
---
  def index
    @group_assignments = GroupAssignment.all