app/controllers/package_installations_controller.rb

SELECT "package_installations".* FROM "package_installations"
---
  def index
    @package_installations = PackageInstallation.all.includes(:system, :package)