app/controllers/package_groups_controller.rb

SELECT "package_groups".* FROM "package_groups"
---
  def index
    @package_groups = PackageGroup.all