app/controllers/package_updates_controller.rb

  def index
    @package_updates = PackageUpdate.all
---
SELECT "package_updates".* FROM "package_updates"

    def set_package_update
      @package_update = PackageUpdate.find(params[:id])
---
SELECT  "package_updates".* FROM "package_updates" WHERE "package_updates"."id" = $1 LIMIT 1  [["id", 6]]