app/controllers/system_updates_controller.rb

SELECT "system_updates".* FROM "system_updates"
---
  def index
    @system_updates = SystemUpdate.all

SELECT  "system_updates".* FROM "system_updates" WHERE "system_updates"."id" = $1 LIMIT 1  [["id", 6]]
---
    def set_system_update
      @system_update = SystemUpdate.find(params[:id])