app/controllers/system_update_states_controller.rb

SELECT "system_update_states".* FROM "system_update_states"
---
  def index
    @system_update_states = SystemUpdateState.all