app/controllers/system_groups_controller.rb

  def index
    @system_groups = SystemGroup.all
---
SELECT "system_groups".* FROM "system_groups"