app/controllers/task_executions_controller.rb

SELECT "task_executions".* FROM "task_executions"
---
  def index
    @task_executions = TaskExecution.all