app/controllers/task_states_controller.rb

SELECT "task_states".* FROM "task_states"
---
  def index
    @task_states = TaskState.all